# SlopedFlangeAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT..::..SlopedFlangeAngle Property
StructuralSectionGeneralT Class See Also
---
Sloped flange angle. (rad)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double SlopedFlangeAngle { get; set; }
```

Visual Basic
---
```text
Public Property SlopedFlangeAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SlopedFlangeAngle {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace